<?php
//=====================================
// 入力チェック用関数
//=====================================

//----------------------------------------
// trim + 改行・タブ・連続スペース削除
//----------------------------------------
function trim_all($str) {
	$str = trim($str);
	$str = preg_replace('/[\n\r\t]/', ' ', $str);
	$str = preg_replace('/\s{2,}/', ' ', $str);
	return($str);
}

//----------------------------------------
// 未初期化・空文字列チェック
//----------------------------------------
function is_empty($str) {
	return(!isset($str) || !strlen(trim($str)));
}
?>
