<?php
//=====================================
// モンスターデータ用関数
//=====================================

//----------------------------------------
// 出現ゾーンID
//----------------------------------------
function monster_zone_id($m_id) {
	return(floor($m_id / 100));
}

//----------------------------------------
// ゾーン内モンスターID
//----------------------------------------
function zone_monster_id($z_id) {
	return($z_id * 100 + 1);
}

//----------------------------------------
// ゾーングループ始点
//----------------------------------------
function monster_group_start($m_id) {
	return(monster_zone_id($m_id) * 100 + 1);
}

//----------------------------------------
// ゾーングループ終点
//----------------------------------------
function monster_group_end($m_id) {
	return(monster_zone_start($m_id) + 99);
}
?>
